{
    "title": "Nimble Ambassador Program",
    "author": "Anthony Isaacson",
    "createDate": "2024-01-24",
    "content": "The Ambassador Program is an initiative to spread the word about Nimble to different industries, locations, and partners. The ambassador's primary roles are to promote, represent, and expand the network of the project they are connected with.\n\n## The Ambassador’s Code of Conduct\n\n* Stay Cheesy \n    * Keep your cool, and respect everyone, even in the face of FUD\n* As real as Gouda \n    * Only give answers you know are true about Nimble\n    * Don’t “hint” at something that’s coming unless it is part of a Team Strategy or already public\n    * It’s okay to say you are not sure or you don’t know\n\n## Sign Up\n\nUse the Google Form to submit your information to join the Ambassador Program. A team member will contact you with the next steps once your application has been reviewed.\n\n**[https://forms.gle/7Pi4vVNkCLBExBcy5](https://forms.gle/7Pi4vVNkCLBExBcy5)**\n\n## Participation Methods and Rewards\n\n### Twitter Threads\n\n**What is it?**\n\nCreate a thread that mentions Nimble, and explains some aspect of what makes it cool or exciting.\n\nTopics: AI, SocialFi, DePIN\n\n**Rewards**\n\n* 50 points per thread\n* 10 points per 100 views\n* 5 points per like/RT/quote\n\n### Video Content\n\n**What is it?**\n\nCreate a video that describes something interesting about Nimble and encourages others to follow the project\n\n**Rewards**\n\n* 100 points per video (2-minute minimum length)\n* 10 points per 100 views\n* 5 points per like/RT/quote\n\n### Twitter Meme Content\n\n**What is it?**\n\nPost a meme about Nimble (or cheese) and tag us.\n\n**Rewards**\n\n* 10 points per meme\n* 10 points per 100 views\n* 5 points per like/RT/quote\n\n### IRL Meetups\n\n**What is it?**\n\nRun an in-person meetup event to spread the word about Nimble to your local audience:\n\n* University groups\n* Crypto-friendly regions\n* Local crypto meetups\n\n**Rewards**\n\n* 400 points per event\n* 25 points per unique signup (tracked via unique Discord link - must pre-register event)\n\n### Advisory Call\n\n**What is it?**\n\nAttend an Ambassador Advisor session (30-minute weekly call)\n\n**Rewards**\n\n* 100 points per call for attendance and participation\n\n### Partner Introductions\n\n**What is it?**\n\nIntroduce Nimble to a key partner or KOL.\n\n**Rewards**\n\nFixed point reward per qualified lead\n\n* 200 points per introduction\n\nPlus negotiable bonus based on the outcome.\n\n**Reward Collection**\n\nNimble is using Nimbus and Discord to track and validate rewards from Ambassador activity.\n\nTo submit a claim, post proof of your submission to Discord and tag burbabull.\n\n## FAQ\n\n**Does being a long-time member of the Nimble community help my application?**\n\nWe plan to prioritize Ambassador applications submitted by individuals who are long-serving members of our Discord or Telegram communities and/or their prior contributions to those communities. But everything is possible in this big, bright world of ours!\n\n**Am I an employee or Agent of Nimble?**\n\n​You are an independent contributor and not an employee or agent of Nimble. You have no right to incur any obligations on Nimble’s behalf. You can terminate your status as an Ambassador anytime and for any reason. Similarly, your appointment as an Ambassador can be revoked, suspended, or conditioned by the Nimble Team at any time and for any reason.\n\n**How can content that I publish or post be used?**\n\nOnce published, anyone can use or reference your content for any purpose. In particular, by acting as an Ambassador, you are granting to Nimble the non-exclusive, perpetual, royalty-free, worldwide right and license, without restriction or limitation, to publish, broadcast, and otherwise use and distribute any and all content or portion thereof that you say, publish or post about Nimble, platform in any all printed, audio, visual, electronic mixed media or other formats.\n\n**What rights does Nimble retain?**\n\nNimble has sole discretion in selecting all Ambassadors, determining if Content Creator receives Enhanced status, approval of content ideas and designation of the applicable tie, and final approval of the Nimble Content before publication."
}
