{
    "title": "Computation Composability in AI",
    "author": "Xin Jin",
    "createDate": "2023-01-18",
    "content": "_Computations are hardware that runs data transformations and saves data on the composable AI graph._\n\n\n![alt_text](https://nimble-homepage-blogs.s3.ap-southeast-1.amazonaws.com/assets/blog-images/computation-composability.png \"Composable computation overview\")\n\n\nIn Nimble, miners achieve computation composability by utilizing different hardware devices. Hard disks, memories, CPUs, and GPUs are the major compute resources in the protocol. Mining logic (e.g., data processing and model training) runs on such hardware compute units.\n\n**Validators and Miners**\n\nValidators on the network are responsible for token reward distributions with PoS staking consensus. They treat models and miners as black boxes. Regardless of data processing and model training miners, validators measure AI model performance improvements given the incremental contributions of individual miners. Such performance improvements determine the token reward to individual miners.\n\nIn this way, the MLOps work is not part of the network responsibilities as DevOps work can also be composable network components. For example, certain miners can specialize in DevOps for data pipelines, model training, and large-scale data processing. Model training miners receive network token rewards from validators while rewarding DevOps miners by themselves.\n\nValidators and different types of miners form a self-organizing and autonomous network. Validators reward model training miners, which in turn reward data processing miners. Both types of miners reward the MLOps miners by themselves.\n\n**Developers**\n\nFor the recent advances in frameworks like virtualization techniques, Spark and AI frameworks, and DevOps, data and AI engineers work together in big organizations as independent teams with AI scientists. Similarly, in the Nimble composable AI protocol, they can work together efficiently since miners are composable, as discussed above. Data engineers work as data processing miners, the output of which is used by AI engineers and researchers for model development. Both data and model miners run their logic with the help of DevOps miners.\n\nNimble begets innovations among developers, before which they depend on large organizations.\n\n**What is next?**\n\nNimble is a composable AI protocol with such computation composability for permissionless innovations. Developers and scientists run miners, given their expertise.\n\nThis is the 3rd blog in the AI Composability series. To learn more, please refer to blogs on data and model composability."
  }
