{
    "title": "FAQ",
    "author": "Anthony Isaacson",
    "createDate": "2023-01-12",
    "content": "## Frequently Asked Questions\n\n**What is the project vision?**\n\nNimble is **_decentralizing Silicon Valley_** with the composable AI protocol design.\n\nThe internet is the most powerful connective force in history. Billions of people across the globe communicate and transact in real-time. The data produced through our online activity powers the AI models that drive the digital economy.\n\nNimble is enabling an open economy for data and intelligence. Our composable AI protocol will provide a decentralized framework that enables AI models and data to be combined and reused. A network of interconnected AI agents, data providers, and compute resources replaces centralized platforms. Anyone can own, run, and train enterprise-grade AI over the decentralized network.\n\nIn the same way that Google made the world’s data accessible to all, Nimble aims to democratize the exchange of intelligence to enable permissionless innovation.\n\nFor more details, please refer to our[ vision doc](https://docs.nimble.technology/).\n\n**What is the project roadmap?**\n\nNimble is to enable AI demand by the end of Q1 2024. This is followed by a the marketplace distribution mechanism in Q2 2024 and the infrastructure launch.\n\nFor more details, please refer to our[ roadmap doc](https://docs.nimble.technology/intent-solicitation/roadmap).\n\n**When will Nimble do an exchange token listing?**\n\nTo be aligned with the roadmap above, the token listing will happen right after the infrastructure launch by Q2 2024. If the infrastructure launch happens earlier than expected, the token listing will be ahead of the schedule as well.\n\n**What is Nimble’s Tokenomics?**\n\nThe following table shows high-level token distributions. Please refer to the tokenomics doc for more info.\n\n\n![alt_text](/assets/blog-images/tokenomics-table.png \"Nimble Tokenomics\")\n\n\n**How do I become a miner?**\n\nOnce the miner SDKs are released, any developer can contribute and become miners following our miner governance policy. The policy will be released once it is ready. It is expected miners can contribute starting end of Q1 2024.\n\n**What are the potential security attacks, and how is the network kept secure?**\n\nThere are various attack vectors, which are fully discussed in our security blog.\n\n**What AI models and applications will be supported?**\n\nNimble is building the composable AI protocol. The network supports generic purpose miners. It includes but is not limited to an ecosystem built around AI models, social recommendations, DeFi operations, offline service requests, and more. To jumpstart the network, Nimble will launch AI mining functionalities with SDKs. After that, developers can build DApps for any type of AI application.\n\nFor more info about the AI protocol design, please refer to the whitepaper and litepaper.\n\n**How does the network achieve scalability?**\n\nThe network is scalable with the unique network auction design and efficient AI operation dispatching algorithm.\n\nFor more info, please refer to the[ whitepaper](https://nimble.technology/whitepaper) for detailed modular auction design.\n\n**What do the roles mean in Discord?**\n\nFor updated information about community roles, view the [roles thread](https://discord.com/channels/1139328143400894604/1165053157391478825/1195457393904058368) in our Discord community. \\\n \\\n**How to become community managers or moderators?**\n\nJoin our[ Discord](https://discord.gg/9VgEwsA7xJ) and start contributing first. Then, you will naturally have opportunities to become community managers or moderators.\n\n**What is the GTM strategy?**\n\nNimble builds the social and large action model first to jumpstart the network. This is followed by the building of the infrastructure ecosystem.\n\n**What is the network token utility and revenue model for the token?**\n\nToken appreciations come from infrastructure gas fees, model bids quoted by network tokens, and miner staking.\n\n**How are NIMBLE tokens created?**\n\n45% of tokens are reserved for mining and validating, released within 48 months since the token generation event (TGE). Each halving cycle has 2102400 blocks, and each blockstep is 15 seconds. New tokens are produced every block at a fixed rate. Roughly 114.155251142 tokens are created per block at TGE. This will be halved every 12 months (i.e., 365 days). Newly minted tokens are shared among miners and validators equally. Validators stake to get network validation rewards.\n\nThe miners are AI model providers who provide real AI model solutions to the network.\n\n**Why do NIMBLE tokens have value?**\n\nEach token is mapped to a real AI matching or model solution provision effort by miners. With the growth of the network and halving every 12 months, getting minted NIMBLE tokens becomes more and more competitive.\n\n**Why should I delegate my NIMBLE?**\n\nEveryone can delegate NIMBLE tokens to validators and earn staking rewards. Validators compete with each other to decide the percentage of staking rewards. The reward market introduces competition among validators and improves the network's robustness.\n\n\n#### **More Questions?**\n\nIf you have more questions, please join Nimble[ Discord](https://discord.gg/9VgEwsA7xJ) and ask there. Then, your questions will be consolidated into this doc for the general community's benefit."
  }
