{
    "title": "Ranking System Case Study - Composable AI Protocol",
    "author": "Xin Jin",
    "createDate": "2024-01-19",
    "content": "_Ranking systems are composable on Nimble._\n\n\n![alt_text](https://nimble-homepage-blogs.s3.ap-southeast-1.amazonaws.com/assets/blog-images/ranking-system.png \"Ranking system overview\")\n\n\n**Powerful Ranking Systems**\n\nSearch, recommendation, and ads systems are powered by AI ranking models behind the scenes. Google search is a personalized ranking system given user search queries. TikTok, Facebook feeds, and Youtube are personalized recommendations to rank videos, social feeds, etc. The ads system is to rank ads from advertisers for users. Such AI rankings are all at hundreds of gigabytes, if not several terabytes.\n\nArticles, products, videos, comments, and ad creatives are called items in the AI ranking models.\n\n**Retrieval and Ranking**\n\nThe major ranking systems can be decomposed into retrieval and ranking components. Retrieval models are either rule-based or deep learning-based. They are composable pieces to filter hundreds of thousands of relevant items from the large item repository (e.g., millions of products on Amazon).\n\nBoth retrieval and ranking systems run as two-tower models in the latest AI systems. The user tower represents user interests with a deep neural network, while the item tower represents the item similarities. User and item towers are reusable for ads ranking and feed recommendations. Various tasks can customize their prediction model on top of them.\n\nThus, the ranking system is composable. In the following, we use the user tower to illustrate how it can be first divided into smaller composable units as independent miners.\n\n**Composable User Model**\n\nUser model features include batch features and real-time features. They can be run as independent feature pipelines by miners. Such miners crawl public raw data and create handcrafted features as miners. They can also reward private data contributions.\n\nUser modeling is an area with fast innovations. AI scientists read the latest research papers and articles and run model validations given a smaller dataset. ML engineers evaluate and iterate AI model solutions on a bigger data set. Data engineers work with ML engineers for feature set iterations and data pipeline automation.\n\nThe system and specialized AI models are composable on Nimble in ranking systems.\n\n**What is next?**\n\nMainstream AI applications and models are composable on Nimble. \n\nThis is the 2nd blog of the case study series. Please refer to blogs on large language model and other case studies to learn more."
  }
