{
  "title": "Nimble Tokenomics",
  "author": "Xin Jin",
  "createDate": "2024-01-11",
  "content": "This post details how the NIMBLE token is distributed to various participants of the Nimble Network and associated ecosystems. Thoughtful distribution of Nimble tokens is vital for on-chain governance and ensuring a fully decentralized, permissionless, and sustainable ecosystem.\n\nToken-based governance enables token holders to guide the development of Nimble. This document aims to prepare the community to participate in governance events so token holders can productively shape the protocol's future.\n\n\n### **Terminology**\n\n\n\n* NIMBLE is the official symbol of the token used in Nimble Network.\n* NIM is short for NIMBLE.\n* VIM: 1 VIM = 10^-9 NIM.\n\n\n### **Governance and the Nimble DAO**\n\nNimble governance will aid in decision-making as we develop or alter network mechanisms in the future. The governance body is responsible for decisions such as:\n\n\n\n* Selection of updates to be applied to programs across the blockchain\n* Fee determination\n* Reward determination\n* Miner permission structures\n* Updates to interpretation models\n\nAdditional topics may be added in the future, with approval by the DAO.\n\n\n### \n![alt_text](https://nimble-homepage-blogs.s3.ap-southeast-1.amazonaws.com/assets/blog-images/token-distribution-table.png \"Nimble tokenomics distribution\")\n\n\n\n### \n![alt_text](https://nimble-homepage-blogs.s3.ap-southeast-1.amazonaws.com/assets/blog-images/token-vesting-table.png \"Nimble token vesting table\")\n\n\n\n### **Network & Ecosystem**\n\n**30%, or 300,000,000 NIMBLE**\n\nThis reward allocation is reserved for those who contribute to the Nimble Network. Contributions may come from a variety of sources.\n\n\n\n* Protocol developers\n* App developers\n* Educators\n* Early miners\n* Early users\n* Network miners\n* Network validators\n\nWith this allocation, we hope to provide incentives and funding for projects to develop functionality with Nimble. Development may include network mining, ecosystem tools, educational events, or other actions that increase awareness of Nimble.\n\n5% of the network NIMBLE allocation is unlocked and can be distributed to this community immediately. The remaining 25% (250M) tokens will be distributed following our vesting schedule.\n\n\n### **Miner Rewards**\n\n**20%, or 200,000,000 NIMBLE**\n\nThis reward allocation is reserved for the network’s miners pool or miners.\n\nMiners contribute a variety of functionality to the Nimble protocol. This “Miner Rewards” allocation is a blend of tokens reserved for reward programs, grants, and scholarships that will encourage developers to build miners.\n\n20M NIMBLE are unlocked for immediate use to incentivize miner development. The remaining 180M NIMBLE are locked, subject to our vesting period as described earlier.\n\nUpon unlocking, tokens will be made available for distribution to miners.\n\n\n### **Community**\n\n**10%, or 100,000,000 NIMBLE**\n\nThe community allocation of NIMBLE is reserved for launch-related purposes.\n\nThis includes launch events, marketing, exchange listing, launchpad, and other events that will drive interest in the protocol.\n\nSince this allocation is required for the immediate use of the network, it is unlocked immediately.\n\n\n### **Development**\n\n**20%, or 200,000,000 NIMBLE**\n\nThe development allocation will be provided to projects or individuals that contribute to core components of the Nimble Network stack. Contributors to the core auction, interpretation stack, or dispatching layer may earn a stake in this allocation.\n\n0% of development NIMBLE allocation is unlocked and can be distributed to developers immediately upon TGE of the network. The remaining 20% will be distributed following our vesting schedule.\n\n\n### **Private Sales**\n\n**20%, or 200,000,000 NIMBLE**\n\nThis allocation is reserved for early funding of the network development, as required by the core team. As of now, these tokens are unallocated.\n\n0% of private sales NIMBLE allocation is unlocked and can be distributed to private investors immediately upon TGE of the network. Once allocated, tokens from the private sale will be subject to the vesting schedule.\n\n\n## **Validation, Mining & Halving**\n\n\n### **Validator & Miner Rewards**\n\nNew tokens are produced every block at a fixed rate. Newly minted tokens are shared among miners and validators, given their contributions to the network. Validators stake to get network validation rewards. The miners are AI miners who provide real model solutions to the network and are rewarded based on the evaluation score of their solutions.\n\nAs a result, for the emitted tokens at each block, there are two layers of distribution.\n\n\n\n1. First, a percentage portion of these emitted tokens is allocated to each of the models/tasks in the network in accordance with its improvement/performance. The network determines these percentage portions. All partial allocations should sum up to 100%. \\\nConsider a model _i_; it has a portion of v% determined by the network. Assume the emission at current block _t_ is _x_t_. Then, all validators and miners participating in the model _i_'s update will receive v% * _x_t_ in total.\n2. Then, validators will receive dividends proportional to their staking ratios, and miners will receive rewards based on their marginal contributions to the model update/task solving. 50% of the tokens emitted to a certain model will be distributed to its validators and another 50% to its miners. For validators, the distribution is calculated by the staking ratio. \\\nSo consider 3 validators, staking 100, 100, and 200, respectively; they will receive 25%, 25%, and 50%. For miners, the distribution is calculated by its marginal contributions (which we use Shapley value in a collaborative system for fair distribution of rewards). So consider 3 miners with Shapley values of 0.2, 0.3 and 0.5; they will receive 20%, 30%, and 50%.\n\nTo conclude, for each model/task _i_,\n\n\n\n* a validator _m_ will receive `v% * _x_t_ * stake_m / (stake sum within this model/task)`\n* a miner _n_ will receive `v% * _x_t_ * shapley_value / (shapley value sum within this model/task)`\n\nMiners and validators map each token to a real AI operation matching or model solution provision effort. With the growth of the network and halving every 12 months, getting minted NIMBLE tokens becomes more and more competitive.\n\n\n### **Production Rate Halving**\n\n45% of tokens are reserved for mining and validating, being released within 48 months since token generation event (TGE). The network token production rate will be halved every 12 months (i.e., 365 days). Each halving has 2102400 blocks and each blockstep is 15 seconds. Roughly 114.155251142 tokens are created per block at TGE, and the initial daily rate is calculated with the following equation, to be more accurate:\n\n\n![alt_text](https://nimble-homepage-blogs.s3.ap-southeast-1.amazonaws.com/assets/blog-images/tokenomics-equation.png \"Nimble tokenomics equation\")\n\n\nin which _i_ is an indexing integer to represent the number of years in the vesting schedule.\n\n\n### **Delegation & Staking**\n\nEveryone can delegate NIMBLE tokens to validators and earn staking rewards. Validators compete with each other to decide the percentage of staking rewards. The reward market introduces competition among validators and improves the network's robustness.\n\n\n### **Conclusions**\n\nWe are still actively working to launch the network. Once launched, expect additional announcements regarding NIMBLE governance. Follow along on our Twitter and Discord community pages for up-to-date information and to avoid inaccurate information about the Nimble project.\n"
}
